---
kind: method
id: M:Autodesk.Revit.DB.DGNExportOptions.#ctor
source: html/0997299e-6bc6-21e4-46b0-95a60648421e.htm
---
# Autodesk.Revit.DB.DGNExportOptions.#ctor Method

Constructs a new instance of DGNExportOptions with default values of all properties.

## Syntax (C#)
```csharp
public DGNExportOptions()
```